Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དེར་ནི་ཆོས་ཀྱི་སྒོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་ཡོངས་སུ་འདུའོ། །ཁོང་དུ་ཆུད་དོ། །མངོན་དུ་གྱུར་ཏོ། །མངོན་པར་འདུའོ། །ཁོངས་ན་འཁོད་དོ། །འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་གི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་སྒོ་དང་། ཆོས་ཀྱི་སྒོ་དང་། སེམས་ཅན་གྱི་སྒོ་དང་། འདས་པའི་སྒོ་དང་། མ་འོངས་པའི་སྒོ་དང་། ད་ལྟར་བྱུང་བའི་སྒོ་དང་། གནས་པའི་མཐའི་སྒོ་དང་། བསོད་ནམས་ཀྱི་སྒོ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་སྒོ་དང་། ཡེ་ཤེས་ཀྱི་སྒོ་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་སྒོ་དང་། སྨོན་ལམ་གྱི་སྒོ་དང་། སྨོན་ལམ་གྱི་རྣམ་པའི་སྒོ་དང་། སྤྱོད་པའི་སྒོ་དང་། སྤྱོད་པ་རྣམ་པར་དག་པའི་སྒོ་དང་། སྤྱོད་པ་ཡོངས་སུ་འབྱུང་བའི་སྒོ་དང་། སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་སྒོ་དང་། ལས་ཀྱི་སྒོ་དང་། ལས་དང་མི་འགལ་བའི་སྒོ་དང་། ལས་ཀྱི་རྒྱུན་གྱི་སྒོ་དང་། ལས་མངོན་པར་འདུ་བྱ་བའི་སྒོ་དང་། མི་མཉམ་པའི་ལས་ཡོངས་སུ་སྤང་བའི་སྒོ་དང་། ཡང་དག་པའི་ལས་ལ་ནན་ཏན་དུ་བྱ་བའི་སྒོ་དང་། ལས་ལ་དབང་བསྒྱུར་བའི་སྒོ་དང་། ལེགས་པར་སྤྱད་པའི་སྒོ་དང་། ལེགས་པར་སྤྱད་པ་ཡང་དག་པར་བླང་བའི་སྒོ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། ཏིང་ངེ་འཛིན་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྒོ་དང་། ཏིང་ངེ་འཛིན་ལ་རྣམ་པར་སྤྱད་པའི་སྒོ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་སྒོ་དང་། ཏིང་ངེ་འཛིན་ལས་ལྡང་བའི་སྒོ་དང་། མངོན་པར་ཤེས་པའི་སྒོ་དང་། སེམས་རྒྱ་མཚོའི་སྒོ་དང་། སེམས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྒོ་དང་། སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་དག་པར་བྱ་བའི་སྒོ་དང་། སེམས་ཀྱི་ཐིབས་པོ་སྣང་བར་བྱ་བའི་སྒོ་དང་། སེམས་ཀྱི་མཚོ་དང་བར་བྱ་བའི་སྒོ་དང་། སེམས་འབྱུང་བའི་སྒོ་དང་། སེམས་རྣམ་པར་རྒྱུ་བའི་སྒོ་དང་། སེམས་ཅན་ཀུན་ནས་ཉོན་མོངས་པ་རྒྱུ་བའི་སྒོ་དང་། ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་སྒོ་དང་། ཉོན་མོངས་པའི་སྦྱོར་བའི་སྒོ་དང་། མོས་པའི་སྒོ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པའི་སྒོ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པའི་སྒོ་དང་། འཇིག་རྟེན་འབྱུང་བའི་སྒོ་དང་། སེམས་ཅན་གྱི་བསམ་པའི་སྒོ་དང་། སེམས་ཅན་གྱི་འདུ་ཤེས་ཀྱི་རྣམ་པའི་སྒོ་དང་། ཕྱོགས་ཀྱི་སྒོ་དང་། ཆོས་ཀྱི་ཕྱོགས་ཀྱི་སྒོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྒོ་དང་། བྱམས་པ་ཆེན་པོའི་སྒོ་དང་། ཞི་བའི་སྒོ་དང་། ངག་གི་ལམ་གྱི་སྒོ་དང་། ཚུལ་གྱི་སྒོ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྒོ་དང་། རྣམ་པར་ཕྱེ་བའི་སྒོ་དང་། ཡང་དག་པར་འདུ་བའི་སྒོ་དང་། ཆགས་པ་མེད་པའི་མཐའི་སྒོ་དང་། ཀུན་གྱི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྒོ་དང་། ཉན་ཐོས་ཀྱི་ཆོས་ཀྱི་སྒོ་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་སྒོ་དང་། འཇིག་རྟེན་འབྱུང་བའི་ཆོས་ཀྱི་སྒོ་དང་། འཇིག་རྟེན་འཇིག་པའི་ཆོས་ཀྱི་སྒོ་དང་། འཇིག་རྟེན་ཀུན་ནས་གནས་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་ཉོན་མོངས་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་ཉོན་མོངས་པ་ལ་རྣམ་པར་དག་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པ་ལ་ཀུན་ནས་ཉོན་མོངས་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་ཀུན་ནས་ཉོན་མོངས་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་རྣམ་པར་དག་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཞི་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྣྲེལ་ཞིའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྤྱིའུ་ཚུགས་སུ་རྒྱུ་བའི་སྒོ་དང་། མྱིག་འཕྲུལ་དུ་འཇུག་པའི་སྒོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཀྱི་སྒོ་དང་། གནས་ཀྱི་འདུ་ཤེས་ཀྱི་རྣམ་པར་གྱུར་པའི་སྒོ་དང་། ཕྲ་བ་རྒྱ་ཆེན་པོར་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྒོ་དང་། རྒྱ་ཆེན་པོ་ཕྲ་བར་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྒོ་དང་། སངས་རྒྱས་མཐོང་བར་བྱ་བའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་སྐུ་རྣམ་པ་ཐ་དད་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་འོད་གཟེར་གྱི་དྲ་བ་རྣམ་པ་ཐ་དད་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་གསུང་གི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་མངོན་པར་བསྒྲུབ་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཐ་དད་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ངེས་པའི་ཚིག་གི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་ཀུན་ཏུ་འཁོར་བའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཀྱི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་སྒོ་དང་།
en: Countless millions of Dharma gateways are present, are included, are manifest, are collected, and are arranged within the range of that power of retention.

source: སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོར་འཇུག་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་སྟོབས་སྣང་བའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་འཕྲུལ་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་སྤྱོད་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་སྤྲུལ་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་སེམས་ཅན་ཕ་རོལ་གྱི་སེམས་ཐུགས་སུ་ཆུད་པའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་འཕྲུལ་པའི་སྒོ་དང་། དགའ་ལྡན་གྱི་ཕོ་བྲང་ན་བཞུགས་པའི་སྒོ་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་བསྟན་པའི་བར་གྱི་སྒོ་དང་། སེམས་ཅན་གྱི་དོན་ཚད་མྱེད་པ་མཛད་པའི་སྒོ་དང་། ཆོས་ཟབ་མོའི་ཚུལ་གྱི་སྒོ་དང་། ཆོས་སྣ་ཚོགས་ཀྱི་ཚུལ་གྱི་སྒོ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཆོས་ཀྱི་རྣམ་པའི་སྒོ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་འབྱུང་བའི་རྣམ་པའི་ཆོས་ཀྱི་སྒོ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཚོགས་ཀྱི་རྣམ་པའི་སྒོ་དང་། སྨོན་ལམ་གྱི་རྣམ་པའི་སྒོ་དང་། སྤྱོད་པའི་རྣམ་པའི་སྒོ་དང་། མངོན་པར་ཤེས་པའི་རྣམ་པའི་སྒོ་དང་། འབྱུང་བའི་རྣམ་པའི་སྒོ་དང་། གཟུངས་རྣམ་པར་དག་པའི་རྣམ་པའི་སྒོ་དང་། ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པའི་རྣམ་པའི་སྒོ་དང་།
en: “There is the gateway to the buddha realms, the gateway to the buddhas, the gateway to the Dharma, the gateway to beings, the gateway to the past, the gateway to the future, the gateway to the present, the gateway to the highest state, the gateway to merit, the gateway to the accumulation of merit, the gateway to wisdom, the gateway to the accumulation of wisdom, the gateway to the forms of prayer, the gateway to conduct, the gateway to pure conduct, the gateway to the creation of conduct, the gateway to the perfection of conduct, the gateway to karma, the gateway to the illumination of karma, the gateway to the continuum of karma, the gateway to the creation of karma, the gateway to the range of karma, the gateway to the avoidance of bad karma, the gateway to the practice of good karma, the gateway to power over karma, the gateway to good behavior, the gateway to the adoption of good behavior, the gateway to samādhi, the gateway to engagement in samādhi, the gateway to the procedure of samādhi, the gateway to the range of samādhi, the gateway to arising from samādhi, the gateway to clairvoyance, the gateway to the ocean of the mind, the gateway to the processes of the mind, the gateway to the purification of the continuum of the mind, the gateway to illuminating the darkness of the mind, the gateway to clarifying the lake of the mind, the gateway to the arising of the mind, the gateway to the activities of the mind, the gateway of the kleśas in beings, the gateway to the propensity for the kleśas, the gateway to the engagement of the kleśas, the gateway to aspiration, the gateway to the conduct of beings, the gateway to the different conducts of beings, the gateway to the creation of worlds, the gateway to the thoughts of beings, the gateway to the form of the conceptualizations of beings, the gateway to the directions, the gateway to the direction of the Dharma, the gateway to great compassion, the gateway to great love, the gateway to peace, the gateway to the path of speech, the gateway to ways, the gateway to following, the gateway to division, the gateway to unification, the gateway to the highest absence of impediments, the gateway to everything, the gateway to the Dharma of the buddhas, the gateway to the Dharma of the bodhisattvas, the gateway to the Dharma of the śrāvakas, the gateway to the Dharma of the pratyeka­buddhas, the gateway to the Dharma of worldly beings, the gateway to the Dharma of the creation of worlds, the gateway to the Dharma of the destruction of worlds, the gateway to the Dharma of the presence of worlds, the gateway to pure world realms, the gateway to afflicted world realms, the gateway to pure and afflicted world realms, the gateway to solely afflicted world realms, the gateway to solely pure world realms, the gateway to entering the level world realms, the gateway to the sideways world realms, the gateway to the world realms of upside-down beings, the gateway to entering illusory manifestations, the gateway to the continuum of world realms, the gateway to the conceptual identification of locations, the gateway to the minute being within the vast, the gateway to the vast being within the minute, the gateway to seeing the buddhas, the gateway to the different forms of the bodies of the buddhas, the gateway to the different nets of light rays of the buddhas, the gateway to the differentiation of the domains of speech of the buddhas, the gateway to the attainment of the wheels of Dharma of the buddhas, the gateway to the differentiation between the wheels of Dharma of the buddhas, the gateway to the meanings of the words in the wheels of Dharma of the buddhas, the gateway to the turning of the wheels of Dharma of the buddhas, the gateway to the actions of the buddhas, the gateway to the circles of followers of the buddhas, the gateway to the differentiation between the circles of followers of the buddhas, the gateway to entering the ocean of the circles of followers of the buddhas, the gateway to the radiance of the strengths of the buddhas, the gateway to the samādhis of the buddhas, the gateway to the miracles of the samādhis of the buddhas, the gateway to the conduct of the buddhas, the gateway to the blessings of the buddhas, the gateway to the emanations of the buddhas, the gateway to the minds of other beings being known by the buddhas, the gateway to the miraculous manifestations of the buddhas, the gateway to residing in Tuṣita, and so on up to the gateway of demonstrating passing into nirvāṇa, the gateway to the accomplishment of limitless benefit for beings, the gateway to the profound way of the Dharma, the gateway to the various ways of the Dharma, the gateway to the forms of the Dharma of the aspiration to enlightenment, the gateway to the forms of the Dharma of the generation of the aspiration to enlightenment, the gateway to the forms of the Dharma of the accumulation of the aspiration to enlightenment, the gateway to the forms of prayer, the gateway to the forms of conduct, the gateway to the forms of clairvoyance, the gateway to the forms of setting forth, the gateway to the forms of pure retention, the gateway to the forms of the pure field of knowledge, the gateway to the forms of pure wisdom, the gateway to the forms of immeasurable enlightenment, and the gateway to the forms of pure remembrance.

source: ཤེས་རབ་ཡོངས་སུ་དག་པའི་རྣམ་པའི་སྒོ་དང་། བྱང་ཆུབ་ཚད་མྱེད་པའི་རྣམ་པའི་སྒོ་དང་། དྲན་པ་རྣམ་པར་དག་པའི་རྣམ་པའི་སྒོ་དག་སྟེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོའི་རྒྱུད་དྲན་པས་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ནམ་མཁའི་དབྱིངས་དང་མཉམ་པ། བློ་གྲོས་ཆོས་ཀྱི་དབྱིངས་ལྟར་ཡངས་པ། རྒྱུད་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་བརྟན་པ། འཇིག་རྟེན་ལས་འདས་པའི་ལམ་དུ་ཞུགས་པ། འཇིག་རྟེན་གྱི་ཆོས་ཡོངས་སུ་མྱི་རྒྱུ་བ། ཡེ་ཤེས་སྣང་བའི་མྱིག་རབ་རིབ་མྱེད་པ་རབ་ཏུ་ཐོབ་པ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་མུན་པ་མྱེད་པར་ཁོང་དུ་ཆུད་པ། བློ་ནམ་མཁའ་ལྟར་ཚད་མེད་པ་དང་ལྡན་པ། དམྱིགས་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་མྱིག་ཅན། ཆགས་པ་མེད་པའི་སྣང་བའི་སྙིང་པོ་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ཀྱི་དོན་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པ། ཟིལ་གྱིས་གནོན་ལ། འཇིག་རྟེན་ཀུན་གྱི་ཟིལ་གྱིས་མི་ནོན་པ། འཇིག་རྟེན་གྱི་སྤྱོད་པའི་ཚུལ་ལ་རྣམ་པར་སྤྱོད་པ། འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ན་ཁ་ན་མ་ཐོ་བ་མེད་པ།
en: “However, noble one, I know only this teaching of the gateway to the perfection of wisdom called the complete display of memory.

source: འཇིག་རྟེན་གྱི་དོན་བྱེད་པ་ལ་བརྩོན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྟེན་དུ་གྱུར་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་ངག་གི་ཚུལ་དང་། རྣམ་པ་ལ་མཁས་པ། འགྲོ་བ་ཐམས་ཅད་དུ་གནས་པའི་བསམ་པ་དང་ལྡན་པ། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམྱིགས་པ་སྟོན་པ། དུས་ཀྱི་འཁོར་ལོ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know or describe the qualities of the bodhisattvas whose minds are as vast as the realm of space, whose understanding is as vast as the realm of phenomena, whose continuum is supported by an accumulation of merit, who follow a path that transcends the world, who do not engage with worldly qualities, who have attained the undimmed radiance of wisdom, who have comprehended the entire realm of Dharma free of darkness, who have an understanding that is as limitless as space, who have the eyes that follow every object of perception, who possess the essence of unimpeded radiance, who are skilled in differentiating the words and meaning of all the Dharma, who overpower without being overpowered by the world, who have a conduct that accords with the ways of worldly conduct, who do not commit any transgression in any of the worldly ways, who are dedicated to the benefit of all worlds, who are a support for all beings, who are skilled in the speech and behavior of all beings, who have the intention to dwell with all beings, who appear in whatever way they are wished to be perceived, and who have power over all the wheels of time.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ།
en: “Depart, noble one.

source: ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་མྱིག་གསུམ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a land called Trinayana.

source: དེ་ན་དགེ་སློང་བལྟ་ན་སྡུག་པ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a bhikṣu by the name of Sudarśana.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བུ་མོ་བྱམས་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བུ་མོ་བྱམས་མ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། བུ་མོ་བྱམས་མའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the maiden Maitrayaṇī, circumambulated the maiden Maitrayaṇī, keeping her to his right, many hundreds of thousands of times, and, looking back again and again, departed from the presence of the maiden Maitrayaṇī.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་རྣམ་པར་སྤྱོད་པ་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཟབ་མོ་ཁོང་དུ་ཆུད་པར་བྱ་བ་རྗེས་སུ་བསམ་པ་དང་། སེམས་ཅན་གྱི་ཡེ་ཤེས་ཤིན་ཏུ་ཕྲ་ཞིང་ཟབ་པ་རྗེས་སུ་བསམ་པ་དང་། འཇིག་རྟེན་གྱི་འདུ་ཤེས་ཀྱི་རྣམ་པ་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། སེམས་ཀྱི་རྒྱུད་ཀྱི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། རང་བཞིན་གྱིས་དབེན་པའི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྣམ་པར་དཔྱོད་པ་བདེན་པའི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་བརྒྱན་པའི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་། ལུས་ཀྱི་འཁྲུལ་འཁོར་ཤུགས་ཀྱིས་འཁོར་བའི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་དང་།
en: Sudarśana Chapter 14 Sudhana, the head merchant’s son, contemplated the profound conduct of wisdom of the bodhisattvas, contemplated reaching the profound basis of the realm of phenomena, contemplated all profound subtle wisdom, contemplated the profound aspect of worldly conceptualization, contemplated the profound ground that is without creation, contemplated the profound ground of the stream of the mind, contemplated the profound ground of dependent origination, contemplated the profound true ground of nature, contemplated the profound true ground of the terminology of beings, contemplated the profound ground of the adorning array of the realm of phenomena, contemplated the profound ground of dependence on the processes of the body, and contemplated the profound ground of the various transformations of the body.

source: ལས་ཀྱིས་སྣ་ཚོགས་སུ་གྱུར་པའི་དབྱིངས་ཟབ་མོ་རྗེས་སུ་བསམ་པ་བྱེད་ཅིང་མཐར་གྱིས་ཡུལ་མྱིག་གསུམ་པ་གང་ན་བ་དེར་ཕྱིན་ཏེ། ཡུལ་གྱི་འཁོར་དང་། གྲོང་ཁྱེར་གྱི་འཁོར་དང་། ཚོང་དུས་ཀྱི་འཁོར་དང་། གྲོང་རྡལ་གྱི་འཁོར་དང་། ཡུལ་གྲུའི་འཁོར་དང་། ལྷས་ཀྱི་འཁོར་དང་།
en: Eventually he arrived at the land of Trinayana.

source: དྲང་སྲོང་དགེ་བ་སྦྱོང་བའི་གནས་ཀྱི་འཁོར་དང་། ཡུལ་དང་ཕྱོགས་ཀྱི་འཁོར་དང་། ཆུའི་རྒྱུད་ཀྱི་འཁོར་དང་། རིའི་སལ་སུལ་གྱི་འཁོར་དང་། ནགས་ཚལ་ཆེན་པོའི་འཁོར་དག་ཏུ་དགེ་སློང་བལྟ་ན་སྡུག་པ་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས་དེས་དགེ་སློང་བལྟ་ན་སྡུག་པ་ནགས་ཚལ་སྟུག་པོ་ཞིག་ན།
en: He searched for the bhikṣu Sudarśana throughout the land, throughout the towns, throughout the cities, throughout the marketplaces, throughout the villages, throughout the cattle pens, throughout the ashrams of ṛṣis, throughout the regions and districts, throughout the banks of rivers, throughout mountain caves, and throughout great forests until he saw the bhikṣu Sudarśana inside a thick forest.

source: གཞོན་ཞིང་དར་ལ་བབ་པ། གཟུགས་མཛེས་ཤིང་སྡུག་ལ་བལྟ་བ་ཡིད་དུ་འོང་བ།
en: The bhikṣu Sudarśana was a young adult, handsome, good looking, and attractive.

source: སྐྲ་མཐོན་ཏིང་གཡས་ཕྱོགས་སུ་འཁྱིལ་བ་དང་ལྡན་པ།
en: His deep black hair curled to the right.

source: མགོ་གདུགས་ལྟར་འདུག་པ།
en: His head was like a parasol.

source: གཙུག་ཏོར་གྱི་སྤྱི་བོ་ཅན།
en: There was an uṣṇīṣa on the crown of his head.

source: འཕྲལ་བ་ཡངས་པ།
en: His forehead was broad.

source: མྱིག་དཀར་ནག་འབྱེས་ཤིང་རིད་ལ།
en: His eyes were wide and deep black.

source: རྫི་མ་བའི་རྫི་མ་ལྟར་འདུག་པ།
en: His eyelashes were like the eyelashes of a cow.

source: སྣའི་དབྱིབས་ལེགས་ཤིང་བཟང་ལ། རན་པར་མཛེས་པ་དང་ལྡན་པ།
en: His nose was lovely, high, and prominent.

source: མཆུ་མཚལ་ལྟར་མདོག་བཟང་ཤིང་ཤིན་ཏུ་ལེགས་པ་དང་ལྡན་པ།
en: His lips were the beautiful color of vermilion and perfectly proportioned.

source: སོ་མཉམ་ཞིང་ཐགས་བཟང་ལ། ཤིན་ཏུ་དཀར་བ་བཞི་བཅུ་ཚང་བ་དང་ལྡན་པ།
en: His teeth were even, without gaps, very white, and a full forty in number.

source: འགྲམ་པའི་ལྷ་ང་སེང་གེ་ལྟར་འདུག་པ།
en: He had jaws like a lion.

source: མཁུར་བ་ཤས་གང་ཞིང་རྒྱས་པ།
en: His cheeks were full and wide.

source: སྨྱིན་ཚུགས་གཞུ་ལྟར་འདུག་ཅིང་རིང་ལ། ཤིན་ཏུ་མཛེས་པ།
en: His eyebrows were long, beautiful, and curved like a bow.

source: མཛོད་སྤུ་ཟླ་བའི་ཁ་དོག་ལྟར་འདུག་པའི་ཐིག་ལེ་ཅན།
en: He had the mark of the ūrṇā hair the color of the moon.

source: རྣ་ཤལ་རིང་ཞིང་ལྷོད་པར་འཕྱང་བ།
en: His earlobes were long and hung loosely.

source: ཟླ་བ་ཉ་བ་ལྟར་བཞིན་མདངས་དང་ལྡན་ཞིང་ཤིན་ཏུ་བཟང་བ།
en: His face was bright and beautiful like the full moon.

source: མགུལ་ཟླུམ་ཞིང་དུང་ལྟར་མཛེས་པ།
en: His throat was round and as beautiful as a conch.

source: སྙིང་ཀ་དཔལ་གྱི་བེའུས་བརྒྱན་པ།
en: His heart area was adorned by the śrīvatsa.

source: རོ་སྟོད་སེང་གེའི་རོ་སྟོད་ལྟར་འདུག་པ།
en: His upper body was like the upper body of a lion.

source: ཐལ་གོང་ཤིན་ཏུ་རྒྱས་པ།
en: His flesh between the shoulder blades was muscular.

source: དཔུང་མ་གོའི་ལྷུན་ལེགས་ཤིང་ཟླུམ་པ།
en: His shoulders were bulky and rounded.

source: ལག་པ་རིང་ལ།
en: His arms were long.

source: དྲ་བས་འབྲེལ་པའི་སོར་མོ་ཅན།
en: His fingers were webbed.

source: རྐ་ལག་འཁོར་ལོས་བརྒྱན་པ།
en: His hands and feet were adorned by wheels.

source: རྐ་ལག་འཇམ་ཞིང་གཞོན་ལ་ཤས་རྒྱས་པ།
en: His hands and feet were soft, young, and thick.

source: བདུན་ཤིན་ཏུ་མཐོ་བ།
en: He had the seven prominences.

source: རྐེད་པ་རྡོ་རྗེ་ལྟར་འདུག་པ།
en: His waist was slim like a vajra’s.

source: ལུས་ཆེ་ཞིང་དྲང་བ།
en: His body was big and straight.

source: བརླ་ཟླུམ་པ།
en: His thighs were round.

source: ཕོ་མཚན་གསང་བའི་སྦུབས་ན་འདུག་པ།
en: His penis was retracted into his body.

source: བྱིན་པ་རི་དགས་ཨེ་ནེ་ཡའི་བྱིན་པ་ལྟར་འདུག་པ།
en: His calves were like the calves of a female blackbuck.

source: སོར་མོ་རིང་བ།
en: His fingers were long.

source: རྐང་པའི་རྟིང་བ་ཡངས་པ།
en: The heels of his feet were wide.

source: འོད་འདོམ་གང་བ་དང་ལྡན་པ།
en: He had a halo a fathom in width.

source: མདོག་གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པ།
en: He was golden in color.

source: བ་སྤུ་རེ་རེ་ནས་གཡས་ཕྱོགས་སུ་གྱེན་དུ་འཁྱིལ་བ།
en: Each of his body hairs was curled upward to the right.

source: ཤིང་ནྱ་གྲོ་དའི་རྒྱལ་པོ་ལྟར་ཆུ་ཞེང་གབ་པ།
en: He had the circular symmetry of a king banyan tree.

source: ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཤིན་ཏུ་བརྒྱན་པ།
en: He was adorned with the signs and features of a superior being.

source: མྱིག་མྱི་འགེབས་ཤིང་མི་རྒོད་པ།
en: His eyes did not blink or waver.

source: དྲན་པ་ཉེ་བར་གནས་པ།
en: He remained in a state of mindfulness.

source: རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་ལྟར་རྩྭ་དང་། ནགས་ཚལ་དང་། སྨན་དང་ཤིང་ཕྲན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: He was like the Himalayas, the king of mountains, adorned with various grasses, forests, herbs, and vines.

source: བློ་ཤིན་ཏུ་ཡངས་པ།
en: His intellect was vast.

source: ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་།
en: He had an invincible range and scope of wisdom.

source: ཡུལ་ལ་ཐུབ་པ་མྱེད་པ། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་སྤྲིན་གྱི་སྒྲ་ལྟ་བུ་དང་ལྡན་པ།
en: The display of the field of his voice was like thunder from the clouds.

source: གཡོ་བ་དང་། རློམ་སེམས་དང་། གཡེང་བ་དང་སྤྲོས་པ་ཐམས་ཅད་དང་བྲལ་བའི་སེམས་དང་ལྡན་པ།
en: His mind was free of all vacillation, conceit, instability, or frivolity.

source: ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་མ་འདྲེས་པ།
en: He had an unalloyed range of wisdom.

source: སངས་རྒྱས་ཀྱི་ཡུལ་རྒྱ་ཆེན་པོའི་སྣང་བ་ཐོབ་པ།
en: He had attained the illumination of the vast range of the wisdom of buddhahood.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བའི་བསམ་པ་རྒྱུན་མྱི་འཆད་པ།
en: He was continuously motivated to ripen and guide all beings.

source: སྙིང་རྗེ་ཆེན་པོའི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཡངས་པ་སྐྱེས་པ།
en: He had developed the vast field of great compassion.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་ཡོངས་སུ་གཟུང་བ་དང་།
en: He was dedicated to possessing the way of the Dharma of all the tathāgatas.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་སྣང་བ་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར།
en: He was dedicated to bringing the light of wisdom to all beings.

source: དེ་བཞིན་གཤེགས་པའི་ཚུལ་རྗེས་སུ་དྲན་ཞིང་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་དུ་འཆག་པ་ལ་ཞུགས་ཏེ།
en: He was mindful of the way of the tathāgatas. He was on the meditation walkway.

source: དྲག་དལ་མྱེད་ཅིང་པད་རལ་མེད་ལ་ཤིན་ཏུ་མཛེས་པར་འཆག་པ།
en: He was walking neither too fast nor too slow, serenely and steadily.

source: གནས་གཙང་མའི་ལྷའི་གོས་དང་ལྡན་པ། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མྱི་འམ་ཅི་དང་།
en: He was dressed like the Śuddhāvāsa devas.

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་དང་། མྱི་དང་མྱི་མ་ཡིན་པས་བསྐོར་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: He was encircled by devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, the world guardians, humans, and nonhumans.

source: དགེ་སློང་བལྟ་ན་མཛེས་པ་དེ་འཆག་པའི་ཚེ། ཕྱོགས་མངོན་དུ་གྱུར་པའི་ཕྱོགས་ཀྱི་ལྷ་རྣམས་ཕྱོགས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་བསྒྲུབ་པ་བྱེད་དོ། །
en: When Sudarśana was going to change the direction in which he was walking, the devas of the directions turned the field of directions around.

source: རྐང་གིས་འགྲོ་བའི་ལྷ་རྣམས་རིན་པོ་ཆེའི་པདྨོས་གོམ་པ་འདོར་བའི་ཚེ། ཡོངས་སུ་བླང་བར་བྱེད་དོ། །
en: The devas of walking received his footsteps on precious lotuses.

source: མྱེའི་ལྷ་སྣང་བའི་དཀྱིལ་འཁོར་ཟད་མྱི་ཤེས་པ་རྣམས་ཀྱང་། མུན་པ་དང་རབ་རིབ་རྣམ་པར་སེལ་ཏོ། །
en: The devas who cause fire, who have unceasing disks of light, dispelled obscuring darkness.

source: འཛམ་བུ་རྒྱལ་མཚན་གྱི་ནགས་ཚལ་གྱི་ལྷ་རྣམས་ཀྱང་མེ་ཏོག་མང་པོའི་ཆར་མངོན་པར་འབེབས་སོ། །
en: The devas of the forest of Jambudhvaja sent down a rain of many flowers.

source: སའི་ལྷ་མི་གཡོ་བའི་སྙིང་པོ་ཅན་རྣམས་ཀྱང་རིན་པོ་ཆེའི་འབྱུང་གནས་མང་པོ་སྟོན་ཏོ། །
en: The devas of the earth, who have the essence of stability, revealed many sources of jewels.

source: ནམ་མཁའི་ལྷ་ཀུན་ནས་སྣང་བའི་དཔལ་དང་ལྡན་པ་རྣམས་ཀྱང་ནམ་མཁའི་དབྱིངས་ཡོངས་སུ་བརྒྱན་པ་བྱེད་དོ། །
en: The devas of the sky, who have the splendor of complete brightness, adorned the surface of the sky.

source: རྒྱ་མཚོའི་ལྷ་དཔལ་ཀུན་ནས་འབྱུང་བ་རྣམས་ཀྱང་རིན་པོ་ཆེ་དམ་པ་མང་པོས་མངོན་པར་འཐོར་ཏོ། །
en: The devas of the ocean, who are the source of splendor, scattered great precious jewels.

source: རི་རབ་ཀྱི་ལྷ་དྲི་མ་མེད་པའི་སྙིང་པོ་ཅན་རྣམས་ཀྱང་ཐལ་མོ་སྦྱར་ཅིང་ཕྱག་འཚལ་ཏོ། །
en: The devas of Sumeru, who have the essence of stainlessness, placed their hands together and paid homage.

source: རླུང་གི་ལྷ་ཐོགས་པ་མེད་པའི་སྟོབས་ཅན་རྣམས་ཀྱང་། སྤོས་དང་། བདུག་སྤོས་དང་། མེ་ཏོག་འཐོར་བའི་རླུང་རབ་ཏུ་འགྱེད་དོ། །
en: The devas of the air, who have unimpeded power, spread breezes that scattered perfume, incense, and flowers.

source: མཚན་མོའི་ལྷ་གནས་པར་བྱེད་པ་ལུས་ཤིན་ཏུ་བརྒྱན་པ་རྣམས་ཀྱང་ལུས་ཤིན་ཏུ་བཏུད་ཅིང་ཕྱག་འཚལ་ཏོ། །
en: The devas of the night, with their bodies bedecked in jewelry, bowed down in homage.

source: ཉིན་མོའི་ལྷ་རྟག་ཏུ་སད་པར་བྱེད་པའི་དཀྱིལ་འཁོར་ཅན་རྣམས་ཀྱང་ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་སྣང་བར་བྱེད་པའི་རྒྱལ་མཚན་ཐོགས་ཤིང་། སྣང་བ་བསྐྱེད་པའི་ཕྱིར་ནམ་མཁའི་དབྱིངས་ལ་འཁོད་དོ། །
en: The devas of the daytime, who have the disk that always causes beings to wake were holding banners of precious jewels that illuminated the directions and standing in the sky in order to create light.
